Revit 2027 API
FailureDefinitionAccessor.GetId Method
 Retrieves the unique identifier of the FailureDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureDefinitionId GetId()
Public Function GetId As FailureDefinitionId
public:
FailureDefinitionId^ GetId()
member GetId : unit -> FailureDefinitionId
Return Value
FailureDefinitionId
 The unique identifier of the FailureDefinition.
Exceptions
Exception | Condition
InvalidOperationException |  The FailureDefinitionAccessor has not been properly initialized.
See Also
Reference
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace